app/views/home/_customer.html.erb

            <tbody>
            <% Restaurant.all.each do |r|%>
---
SELECT "restaurants".* FROM "restaurants"