app/views/home/_restaurant.html.erb

            <tbody>
            <% current_user.restaurant.products.each do |product|%>
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."user_id" = $1 LIMIT $2  [["user_id", 4], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."restaurant_id" = $1  [["restaurant_id", 2]]