app/controllers/products_controller.rb

INSERT INTO "products" ("name", "value", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "pizza"], ["value", 10.0], ["restaurant_id", 2], ["created_at", "2022-03-31 23:08:22.902956"], ["updated_at", "2022-03-31 23:08:22.902956"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save